{
  "appInformation": {
    "name": "LockerRoom Talk: Dating Reviews",
    "subtitle": "Safe Dating Experiences for Everyone",
    "bundleId": "com.lockerroomtalk.app",
    "sku": "lockerroom-talk-ios-app",
    "primaryLanguage": "English (U.S.)",
    "categories": {
      "primary": "Lifestyle",
      "secondary": "Social Networking"
    },
    "contentRights": "Does Not Use Third-Party Content",
    "promotionalText": "Empower safer dating with anonymous reviews, real-time chat, and community insights. Instant access for all users - no waitlists or verification needed. Join the global safety network today!"
  },
  "versionInformation": {
    "version": "1.0.0",
    "copyright": "2025 LockerRoom Talk",
    "releaseType": "Manual Release",
    "earliestReleaseDate": null,
    "versionReleaseNotes": "🎉 Welcome to LockerRoom Talk - your go-to platform for dating safety and community!\n\n✨ Key Features:\n• Anonymous reviews with green/red flags and media support\n• Real-time chatrooms and direct messaging with reactions\n• Advanced search with location filters and trending discovery\n• No ID verification or waitlists - instant access for everyone\n• Global coverage with worldwide location-based insights\n• Premium options for ad-free experience and enhanced tools\n\nBuild a safer dating world together. Start sharing and connecting now!"
  },
  "appDescription": {
    "description": "LockerRoom Talk is the ultimate dating safety platform where users from all walks of life can share anonymous reviews, engage in real-time conversations, and build a supportive community for safer dating experiences. No barriers to entry - no ID verification, no waitlists, just immediate access to valuable insights and connections.\n\n🔥 DATING SAFETY FOR EVERYONE\n\nDiscover and share honest dating experiences without restrictions:\n\n✨ Instant Access - Start using the app right away without any verification or approval processes\n🚫 No Barriers - Guest mode available, 30-second onboarding for quick setup\n💬 Real-Time Community - Live chatrooms, direct messaging, and active discussions\n📍 Global Network - Worldwide coverage with smart location-based discovery\n🛡️ Privacy First - Anonymous reviews and robust safety tools protect your identity\n🌍 Inclusive for All - Welcoming to users of all genders and orientations as part of our commitment to a diverse community\n\n🔍 POWERFUL FEATURES\n\nANONYMOUS REVIEW SYSTEM\n• Share experiences with structured green/red flags for quick insights\n• Upload photos, videos, and media to provide detailed context\n• Location tagging at city/state level for relevant, local advice\n• Sentiment analysis to highlight positive/negative trends\n• Social media links (optional) for verified but private sharing\n\nREAL-TIME CHAT & COMMUNITY\n• Topic-based chatrooms for dating tips, experiences, and support\n• Direct messaging with typing indicators, reactions, and online presence\n• Group discussions and community events for broader engagement\n• Message pagination for seamless history review\n• Cross-platform compatibility for anytime connections\n\nADVANCED SEARCH & DISCOVERY\n• Unified search across reviews, comments, and messages\n• Filters by location, category (e.g., first dates, long-term), distance, and sentiment\n• Trending reviews and popular names for timely insights\n• Smart recommendations based on your search history\n• Deep linking to easily share specific content with friends\n\nCOMPREHENSIVE SAFETY TOOLS\n• Easy reporting and blocking for personal control\n• AI-powered content filtering and human moderation\n• Community guidelines to ensure respectful interactions\n• Granular privacy settings for your comfort\n• Professional oversight to maintain a safe environment\n\n📱 GLOBAL & ACCESSIBLE\n• Works worldwide, not limited to specific regions\n• Accurate distance calculations for proximity-based advice\n• Multi-city search with expanded radius for premium users\n• Offline support for browsing cached content\n• Push notifications for new messages and updates\n\n🎯 PREMIUM ENHANCEMENTS\n\nElevate your experience with LockerRoom Talk Premium:\n• Completely ad-free browsing\n• Extended location search for broader insights\n• Advanced analytics on review trends and personal content\n• Custom themes and profile customization options\n• Priority customer support for quick resolutions\n• Enhanced privacy controls and exclusive features\n\n🌟 WHY CHOOSE LOCKERROOM TALK?\n\nIn a world of dating apps with restrictions and limitations, LockerRoom Talk stands out by providing:\n• Immediate access vs. waitlists and verifications\n• Real community interaction vs. static reviews only\n• Global reach vs. regional constraints\n• Strong privacy without compromising safety\n• Inclusive environment welcoming diverse user experiences\n\nPERFECT FOR:\n• Anyone researching potential dates through honest reviews\n• Users seeking community advice and real-time support\n• Privacy-focused individuals avoiding verification processes\n• Global travelers wanting location-specific dating insights\n• Those building a network for safer relationship decisions\n\nJoin thousands worldwide in creating a safer dating landscape. Whether you're sharing your story, learning from others, or connecting for advice, LockerRoom Talk is your trusted partner in dating safety.\n\nDownload now and start contributing to a better dating community!",
    "keywords": "dating reviews, dating safety, anonymous reviews, dating chat, dating advice, relationship safety, dating experiences, online dating protection, dating community, real time messaging, global dating, privacy dating, safe dating, user reviews, community chat",
    "supportURL": "https://lockerroomtalk.app/support",
    "marketingURL": "https://lockerroomtalk.app",
    "privacyPolicyURL": "https://lockerroomtalk.app/privacy"
  },
  "ageRating": {
    "rating": "17+",
    "reasons": [
      "Mature/Suggestive Themes",
      "User Generated Content",
      "Infrequent/Mild Profanity or Crude Humor",
      "Unrestricted Web Access"
    ]
  },
  "reviewInformation": {
    "contact": {
      "firstName": "Patrick",
      "lastName": "Support",
      "phone": "+1-555-0123",
      "email": "support@lockerroomtalk.app"
    },
    "demoAccount": {
      "username": "demo@lockerroomtalk.app",
      "password": "DemoPass123!",
      "notes": "Demo account with sample dating reviews, chatroom access, and premium features for testing purposes."
    },
    "notes": "LockerRoom Talk is a comprehensive dating safety and community platform where users can:\n\n1. Share anonymous reviews with media support, green/red flags, and location tagging\n2. Engage in real-time chatrooms and direct messaging with advanced features like reactions and presence indicators\n3. Use advanced search with filters for location, category, and sentiment to discover relevant insights\n4. Access instantly without ID verification or waitlists, including guest mode\n5. Benefit from global coverage and inclusive community for all users\n6. Unlock premium features for ad-free experience, extended search, and more\n\nKey Safety Features:\n- Anonymous system with robust reporting, blocking, and moderation (AI + human)\n- Privacy controls and community guidelines for respectful interactions\n- No mandatory verification - focus on user comfort and accessibility\n- Worldwide location support with accurate distance matching\n\nThe app supports:\n- User-generated content with comprehensive moderation\n- In-app purchases for premium subscriptions\n- Real-time capabilities via Supabase backend\n- Location services for enhanced discovery (city/state level)\n- Push notifications and deep linking for sharing\n\nLockerRoom Talk differentiates by offering barrier-free access, real-time community engagement, and global inclusivity, serving a broad audience seeking safer dating experiences without restrictions."
  }
}
